function coins(input) {
    let amount = Math.round(input.shift() * 100);

    let coins = 0;

    while (amount > 0) {

        if (amount >= 200) amount -= 200

        else if (amount >= 100) amount -= 100

        else if (amount >= 50) amount -= 50

        else if (amount >= 20) amount -= 20

        else if (amount >= 10) amount -= 10

        else if (amount >= 5) amount -= 5

        else if (amount >= 2) amount -= 2

        else amount = amount - 1

        coins++;

    }

    console.log(coins);

}

coins([1.23]);
coins([2]);
coins([0.56]);
coins([2.73]);

/*Монети
Производителите на вендинг машини искали да направят машините си да връщат възможно най-малко монети ресто.
Напишете програма, която приема сума - рестото, което трябва да се върне и изчислява с
колко най-малко монети може да стане това.
Примерен вход и изход

Вход
1.23

Изход
4

Обяснения
Рестото ни е 1 лев и 23 стотинки. Машината ни го връща с 4 монети: монета от 1 лев, монета
от 20 стотинки, монета от 2 стотинки и монета от 1 стотинка.

Вход
2
Изход
1
Обяснения
Рестото ни е 2 лева. Машината ни го връща с 1 монета от 2 лева.


Вход
0.56

Изход
3

Обяснения
Рестото ни е 56 стотинки. Машината ни го връща с 3 монети: монета от 50 стотинки, монета
от 5 стотинки и монета от 1 стотинка.

Вход
2.73

Изход
5

Обяснения
Рестото ни е 2 лева и 73 стотинки. Машината ни го връща с 5 монети: монета от 2 лева,
монета от 50 стотинки, монета от 20 стотинки, монета от 2 стотинки и монета от 1 стотинка.

     */