function vacation(input) {
     let moneyForTrip = +input.shift();
     let availableMoney = +input.shift();

     let countDays = 0;
     let countSpend = 0;
     while (availableMoney < moneyForTrip && countSpend < 5) {
          let action = input.shift();
          let money = +input.shift();
          countDays++;
          if (action == "spend" && availableMoney <= money) {
               availableMoney = 0;
               continue;
          }
          if (action == "spend") {
               availableMoney -= money;
               countSpend++;
          }
          else if (action == "save") {
               countSpend = 0;
               availableMoney += money;
          }
          if (countSpend >= 5) {
               console.log("You can't save the money.");
               console.log(`${countDays}`);
               return;
          }

          if (availableMoney >= moneyForTrip) {
               console.log(`You saved the money for ${countDays} days.`);
               break;
          }
     }
}
vacation([2000, 1000, "spend", 1200, "save", 2000]);
vacation([110, 60, "spend", 10, "spend", 10, "spend", 10, "spend", 10, "spend", 10]);
/*Почивка
Джеси е решила да събира пари за екскурзия и иска от вас да ѝ помогнете да разбере дали ще успее да
събере необходимата сума. Тя спестява или харчи част от парите си всеки ден.
Ако иска да похарчи повече от наличните си пари, то тя ще похарчи всичките и ще ѝ останат 0 лева.
Вход

От конзолата се четат:
 Пари нужни за екскурзията - реално число в интервала [1.00…25000.00]
 Налични пари - реално число в интервала [0.00...25000.00]
След това многократно се четат по два реда:
 Вид действие - текст с възможности "spend" и "save".
 Сумата, която ще спести/похарчи - реално число в интервала [0.01…25000.00]
Изход
Програмата трябва да приключи при следните случаи:
 Ако 5 последователни дни Джеси само харчи, на конзолата да се изпише:
o "You can't save the money."
o "{Общ брой изминали дни}"
 Ако Джеси събере парите за почивката на конзолата се изписва:
o "You saved the money for {общ брой изминали дни} days."
Примерен вход и изход
Вход
2000
1000
spend
1200
save
2000

Изход
You saved the
money for 2 days.

Обяснения
Пари, нужни за екскурзията: 2000
Налични пари: 1000
spend - изваждаме от парите следващото число
(1000 - 1200 = -200, което е по-малко от 0
=> налични пари = 0)
~ последователни дни, в които харчи = 1
- общо дни : 1
save - добавяме към парите следващото число
(0 + 2000 = 2000)
~ последователни дни, в които харчи = 0
- общо дни : 2
Наличните пари (2000) >= Пари, нужни за екскурзията (2000)

Вход
110
60
spend
10
spend
10
spend
10
spend
10
spend
10

Изход
You can't save
the money.
5

Обяснения
Пари, нужни за екскурзията: 110
Налични пари: 60
spend – изваждаме от парите следващото число (60 - 10 = 50)
~ последователни дни, в които харчи = 1
- общо дни : 1
spend – изваждаме от парите следващото число (50 - 10 = 40)
~ последователни дни, в които харчи = 2
- общо дни : 2
spend – изваждаме от парите следващото число (40 - 10 = 30)
~ последователни дни, в които харчи = 3
- общо дни : 3
spend – изваждаме от парите следващото число (30 - 10 = 20)
~ последователни дни, в които харчи = 4
- общо дни : 4
spend – изваждаме от парите следващото число (20 - 10 = 10)
~ последователни дни, в които харчи = 5
- общо дни : 5
5 последователни дни харчи => налични пари: 10
Наличните пари (10) < Пари, нужни за екскурзията (110)

Вход
250
150
spend
50
spend
50
save
100
save
100

Изход
You saved the
money for 4 days.

Обяснения
Пари, нужни за екскурзията: 250
Налични пари: 150
spend - изваждаме от парите следващото число (150 - 50 = 100)
~ последователни дни, в които харчи = 1
- общо дни : 1
spend - изваждаме от парите следващото число (100 - 50 = 50)
~ последователни дни, в които харчи = 2
- общо дни : 2
save - добавяме към парите следващото число (50 + 100 = 150)
~ последователни дни, в които харчи = 0
- общо дни : 3
save - добавяме към парите следващото число (150 + 100 = 250)
~ последователни дни, в които харчи = 0
- общо дни : 4
Наличните пари (250) &gt;= Пари, нужни за екскурзията (250)

Насоки
1. Прочетете входните данни от конзолата:

2. Направете две помощни променливи в началото, които да следят броя изминали дни и броя
последователни дни, в които Джеси харчи пари. Нека и двете променливи да бъдат с първоначална
стойност нула:

Създайте while цикъл, който продължава, докато парите на Джеси са по-малко от парите, които са ѝ
нужни за екскурзията и броячът за последователните дни е по-малък от 5. При всяко повторение на
цикъла четете от конзолата два реда - първият ред е текст - spend или save, а вторият – парите, които
Джеси е спестила или похарчила. Също така увеличете брояча за дни с 1:
3. Направете проверка дали Джеси харчи или спестява за дадения ден:
 aко спестява, прибавете спестените пари към нейните и нулирайте брояча за поредните дни;
 aко харчи, извадете от нейните пари сумата която е похарчила и увеличете брояча за
поредните дни, в които харчи. Проверете дали парите на Джеси са станали по-малко от нула
и ако е така, то тя е останала без пари и има нула лева
4. След цикъла проверете дали Джеси е харчила пари в пет последователни дни и принтирайте
съобщението. Също така проверете дали Джеси е събрала парите и, ако е успяла, принтирайте
съответното съобщение:

     */
