function walking(input) {
        let steps = 0;

        while (steps <= 10000) {
            let command = input.shift();
            if(command == "Going home"){
                steps += Number(input.shift());
              if(steps >= 10000){
                    console.log("Goal reached! Good job!");
                }else{
                    let diff = 10000 - steps;
                    console.log(`${diff} more steps to reach goal.`);
                }
                break;
            } else{
                steps += Number(command);
                if(steps >= 10000){
                    console.log("Goal reached! Good job!");
                    break;
                } 
            }
            
        }
}

walking([1000, 1500, 2000, 6500]);
walking([1500, 300, 2500, 3000, "Going home", 200]);
walking([1500, 3000, 250, 1548, 2000, "Going home", 2000]);
walking([125, 250, 4000, 30, 2678, 4682]);
/*Стъпки
Габи иска да започне здравословен начин на живот и си е поставила за цел да върви 10 000 стъпки всеки ден.
Някои дни обаче е много уморена от работа и ще иска да се прибере преди да постигне целта си.
Напишете програма, която чете от конзолата по колко стъпки изминава тя всеки път като излиза през деня и когато
постигне целта си да се изписва "Goal reached! Good job!"
Ако иска да се прибере преди това, тя ще въведе командата "Going home" и ще въведе стъпките, които е
извървяла докато се прибира. След което, ако не е успяла да постигне целта си, на конзолата трябва да се
изпише: "{разликата между стъпките} more steps to reach goal."
Примерен вход и изход
Вход
1000
1500
2000
6500

Изход
Goal reached! Good job!


Вход
1500
300
2500
3000
Going home
200

Изход
2500 more steps to reach goal.

Вход
1500
3000
250
1548
2000
Going home
2000


Изход
Goal reached! Good job!



Вход
125
250
4000
30
2678
4682

Изход
Goal reached! Good job!



Насоки
1. Създайте променлива, чрез която ще следите, колко стъпки е извървяла Габи и while, който ще
продължава, докато Габи не достигне целта си.

2. При всяко повторение на цикъла взимайте по един елемент от аргумента на функцията.

3. Проверете, дали полученият елемент е Going home и ако е, прибавяйте стъпките, които е извървяла
до тях, в противен случай, прибавяйте стъпките, които е извървяла.
4. В случая, в който Габи се прибира, проверете, дали е достигнала целта си, ако не е успяла намерете
разликата между нейната цел и стъпките, които е успяла да извърви, отпечатайте нужното съобщение
и след това прекъснете цикъла чрез командата break.*/