function clock(){
  
    for(let hours = 0; hours < 24; hours++){
        for(let minutes = 0; minutes < 60; minutes++){
            console.log(`${hours}:${minutes}`);
        }
    }

}
clock([]);
/*Часовник
Напишете програма, която отпечатва часовете в денонощието от 0:0 до 23:59, всеки на отделен ред.
Часовете трябва да се изписват във формат "{час}:{минути}".
Примерен вход и изход
Вход 
(няма вход) 


Изход
0:0
0:1
0:2
0:3
0:4
0:5
0:6
0:7
0:8
0:9
0:10
...
23:50
23:51
23:52
23:53
23:54
23:55
23:56
23:57
23:58
23:59

Насоки
1. Създайте 2 вложени for-цикъла, с които да итерирате през всяка една минута и час от денонощието:*/