function combinations(input) {
    let n = +input[0];

    let validCombinations = 0;
    for (let i = 0; i <= n ; i++) {
        for (let j = 0; j <= n ; j++) {
            for (let k = 0; k <= n ; k++) {
              
                        if (i + j + k  == n){
                            validCombinations++;
                        }
                    }
                }
            }
        
console.log(validCombinations);
}
combinations([25]);
/*Комбинации
Напишете програма, която изчислява колко решения в естествените числа (включително и нулата) има
уравнението:
x1 + x2 + x3 = n
Числото n е цяло число и се въвежда от конзолата.
Примерен вход и изход
Вход
25

Изход
351
Генерираме всички комбинации от 3 числа,като първата е:

0+0+0=0, но понеже не е равна на 25,продължаваме:

0+0+1=1 – също не е 25 и т.н
Стигаме до първата валидна комбинация:
0 + 0 + 25 = 25, увеличаваме броя на валидни комбинации с 1,
втората валидна комбинация е:
0 + 1 + 24 = 25
Третата:
0 + 2 + 23 = 25 и т.н
След генериране на всички възможни
комбинации, броят на валидните е 351.


Вход
20

Изход
231

Вход
5

Изход
21

Насоки:
1. Извадете входните данни – едно число и го запаметете в променлива:

2. Създайте 3 вложени for-цикъла, с които да итерирате всяка възможна стойност на едно от 3те числа
в уравнението:*/