function sumOfTwoNumbers(input) {

    let firstNum = +input[0];
    let secondNum = +input[1];
    let magicNum = +input[2];
    let count = 0;
    let sum;

    for (let i = firstNum; i <= secondNum; i++) {
        for (let j = firstNum; j <= secondNum; j++) {
            sum = i + j;
            count++;
            if (sum == magicNum) {
                console.log(`Combination N:${count} (${i} + ${j} = ${magicNum})`);
                return;
            }
        }
    }
    console.log(`${count} combinations - neither equals ${magicNum}`);
}
sumOfTwoNumbers([23, 24, 20]);
/*Сума от две числа
Напишете програма която проверява всички възможни комбинации от двойка числа в интервала от две
дадени числа.
На изхода се отпечатва, коя поред е комбинацията чиито сбор от числата е равен на дадено
магическо число. Ако няма нито една комбинация отговаряща на условието се отпечатва съобщение, че не е
намерено.
Вход
Входът се чете от конзолата и се състои от три реда:
 Първи ред – начало на интервала – цяло число в интервала [1...999]
 Втори ред – край на интервала – цяло число в интервала [по-голямо от първото число...1000]
 Трети ред – магическото число – цяло число в интервала [1...10000]

Изход
На конзолата трябва да се отпечата един ред, според резултата:
 Ако е намерена комбинация чиито сбор на числата е равен на магическото число
o "Combination N:{пореден номер} ({първото число} + {второ число} = {магическото число})"
 Ако не е намерена комбинация отговаряща на условието
o "{броят на всички комбинации} combinations - neither equals {магическото число}"
Примерен вход и изход


Вход
1
10
5

Изход
Combination N:4
(1 + 4 = 5)


Обяснения
Всички комбинации от две числа
между 1 и 10 са:
1 1, 1 2, 1 3, 1 4, 1 5, ... 2 1, 2 2, ... 4 9, 4
10, 5 1 ... 10 9, 10 10
Първата комбинация, чиито сбор на
числата е равен на магическото число 5
е четвъртата (1 и 4)

Вход
88
888
1000

Изход
Combination
N:20025 (112 + 888
= 1000)

Вход
23
24
20

Изход
4 combinations -
neither equals
20


Обяснения
Всички комбинации от две числа
между 23 и 24 са: 23 23, 23 24, 24 23, 24
24 (общо 4)
Няма двойки числа, чиито сбор е равен
на магическото 20


Вход
88
888
2000

Изход
641601
combinations -
neither equals
2000
             */