function moving(input) {
    let width = +input.shift();
    let length = +input.shift();
    let height = +input.shift();

    let volume = Number(width * length * height);
    while ("Done" != input) {
        let box = Number(input.shift());

        if ((volume - box) < 0) {
            console.log(`No more free space! You need ${Math.abs(volume - box)} Cubic meters more.`);
            volume = volume - box;
            break;
        }
        volume -= box;
    }
    if (volume >= 0) {
        console.log(`${volume} Cubic meters left.`);
    }
}
moving([10, 10, 2, 20, 20, 20, 20, 122]); 
moving([10, 1, 2, 4, 6, "Done"]);
/**Преместване
На осемнадесетия си рожден ден на Хосе взел решение, че ще се изнесе да живее на квартира.
Опаковал багажа си в кашони и намерил подходяща обява за апартамент под наем.
Той започва да пренася своя багаж на части, защото не може да пренесе целия наведнъж.
Има ограничено свободно пространство в новото си жилище, където може да разположи вещите,
така че мястото да бъде подходящо за живеене.
Напишете програма, която изчислява свободния обем от жилището на Хосе, който остава след като пренесе багажа си.
Бележка: Един кашон е с точни размери: 1m. x 1m. x 1m.
Вход
Потребителят въвежда следните данни на отделни редове:
1. Широчина на свободното пространство - цяло число в интервала [1...1000]
2. Дължина на свободното пространство - цяло число в интервала [1...1000]
3. Височина на свободното пространство - цяло число в интервала [1...1000]
4. На следващите редове (до получаване на команда "Done") - брой кашони, които се пренасят в
квартирата - цели числа в интервала [1...10000];
Програмата трябва да приключи прочитането на данни при команда "Done" или ако свободното място
свърши.
Изход
Да се отпечата на конзолата един от следните редове:
- Ако стигнете до командата "Done" и има още свободно място:
"{брой свободни куб. метри} Cubic meters left."
- Ако свободното място свърши преди да е дошла команда "Done":
"No more free space! You need {брой недостигащи куб. метри} Cubic meters more."
Примерен вход и изход
Вход

10
10
2
20
20
20
20
122

Изход
No more free space! You need 2 Cubic meters more.


10 * 10 * 2 = 200 кубични метра.
20 + 20 + 20 + 20 + 122 = 202 кубични
метра.
200 - 202 = 2 недостигащи кубични метра

Вход

10
1
2
4
6
Done

Изход
10 Cubic meters left.

Обяснение
10 * 1 * 2 = 20 кубични метра.
4 + 6 = 10 кубични метра.
20 - 10 = 10 кубични метра.*/