function sequence(input) {
    let number = Number(input.shift());

    let x = 1;

    while (x <= number) {
        console.log(x);
        x = x * 2 + 1;

    }


}
sequence([8]);

/*Редица числа 2k+1
Напишете програма, която чете число n, въведено от потребителя и отпечатва всички числа ≤ n от редицата:
1, 3, 7, 15, 31, …. Всяко следващо число се изчислява като умножим предишното с 2 и добавим 1.
Примерен вход и изход
вход
3

изход
1
3

вход
8
изход
1
3
7

вход
17
изход
1
3
7
15

вход
31
изход
1
3
7
15
31                    */