function HotelRoom(input){
    let month = input.shift();
    let night = Number(input.shift());
    
    let studio = 0.0;
    let apartment = 0.0;
    
            if ("May" === month || "October" === month) {
                studio = night * 50;
                apartment = night * 65;
    
                if (night > 7 && night <= 14) {
                    studio = night * 50 * 0.95;
                } else if (night > 14) {
                    apartment = night * 65 * 0.90;
                    studio = night * 50 * 0.70;
                }
            } else if ("June" === month || "September" === month) {
                studio = night * 75.20;
                apartment = night * 68.70;
    
                if (night > 14) {
                    studio = night * 75.20 * 0.80;
                    apartment = night * 68.70 * 0.90;
                }
            } else {
                studio = night * 76;
                apartment = night * 77;
    
    
                if (night > 14) {
                    apartment = night * 77 * 0.90;
                }
            
    
    }console.log(`Apartment: ${apartment.toFixed(2)} lv.`);
    console.log(`Studio: ${studio.toFixed(2)} lv.`)
    }
hotelRoom(["May",15]);
hotelRoom(["June",14]);
hotelRoom(["August",20]);
/*Хотелска стая
Хотел предлага 2 вида стаи: студио и апартамент. 
Напишете програма, която изчислява цената за целия престой за студио и апартамент. 
Цените зависят от месеца на престоя:
 
Май и октомври                 Юни и септември                   Юли и август
Студио – 50 лв./нощувка        Студио – 75.20 лв./нощувка        Студио – 76 лв./нощувка
Апартамент – 65 лв./нощувка    Апартамент – 68.70 лв./нощувка    Апартамент – 77 лв./нощувка

Предлагат се и следните отстъпки:
 За студио, при повече от 7 нощувки през май и октомври : 5% намаление.
 За студио, при повече от 14 нощувки през май и октомври : 30% намаление.
 За студио, при повече от 14 нощувки през юни и септември: 20% намаление.
 За апартамент, при повече от 14 нощувки, без значение от месеца : 10% намаление.
Вход
Приемат се 2 реда, извадени от входния аргумент:
 На първия ред е месецът – May, June, July, August, September или October
 На втория ред е броят на нощувките – цяло число в интервала [0 ... 200]
Изход
Да се отпечатат на конзолата 2 реда:
 На първия ред: "Apartment: {цена за целият престой} lv."
 На втория ред: "Studio: {цена за целият престой} lv."
Цената за целия престой форматирана с точност до два знака след десетичната запетая.
Примерен вход и изход
Вход  
May
15

Изход
Apartment: 877.50 lv.
Studio: 525.00 lv.

Обяснения
През май, при повече от 14 нощувки, намаляваме цената на студиото
с 30% (50 – 15 = 35), а на апартамента – с 10% (65 – 6.5 =58.5).
Целият престой в апартамент – 877.50 лв.
Целият престой в студио – 525.00 лв.

Вход 
June
14

Изход
Apartment: 961.80 lv.
Studio: 1052.80 lv.


Вход
August
20

Изход
Apartment: 1386.00 lv.
Studio: 1520.00 lv.
                             */