function equalSumsEvenOddPosition(input) {

    let firstNumber = Number(input.shift());
    let secondNumber = Number(input.shift());
    let printLine = "";
    for (let i = firstNumber; i <= secondNumber; i++) {
        let currentNumber = "" + i;
        let evenSum = 0;
        let oddSum = 0;
        for (let j = 0; j < currentNumber.length; j++) {
            let currentDigit = currentNumber.charCodeAt(j);
            if (j % 2 == 0) {
                evenSum += currentDigit;
            }
            else {
                oddSum += currentDigit;
            }
        }
        if (evenSum == oddSum) {
            printLine += i + " ";
        }
        
    }
    console.log(printLine);
    
}
equalSumsEvenOddPosition([100000, 100050]);
equalSumsEvenOddPosition([123456, 124000]);
equalSumsEvenOddPosition([299900, 300000]);
equalSumsEvenOddPosition([100115, 100120]);
/*Еднакви суми на четни и нечетни позиции
Напишете програма, която чете от конзолата две шестцифрени цели числа в диапазона от 100000 до 300000.
Винаги първото въведено число ще бъде по малко от второто.
На конзолата да се отпечатат на 1 ред разделени с интервал всички числа,
които се намират между двете, прочетени от конзолата числа и отговарят на следното условие:

 сумата от цифрите на четни и нечетни позиции да са равни.
Ако няма числа, отговарящи на условието на конзолата не се извежда резултат.

Примерен вход и изход
Вход
100000
100050

Изход
100001 100012 100023 100034 100045


Обяснения
Първото число, което генерираме е числото 100000. Сумата от цифрите на
четни позиции (жълто) е 0+0+0=0. Сумата от цифрите на нечетни позиции
(зелено) е 0+0+1=1. Тъй като двете суми са различни числото не се
отпечатва.
Следващото, число е 100001. Сумата на четни позиции е 1+0+0=1, а на
нечетни 0+0+1=1. Двете суми са равни и числото се отпечатва.
Следващото число за проверка е 100002. То не отговаря на условието и не
се отпечатва.
При числото 100045 сумата от четните позиции е 5+0+0=5, а на нечетни
4+0+1=5. Двете суми са равни числото се отпечатва. И т.н.

Вход
123456
124000

изход
123464 123475 123486 123497 123530 123541 123552 123563 123574 123585 123596 123640 123651 123662 123673 123684
123695 123750 123761 123772 123783 123794 123860 123871 123882 123893 123970 123981 123992


Вход
299900
300000

изход
299970 299981 299992


Вход
100115
100120

изход
Няма изход
                     */