function fishTank(input){
 
    let length = Number(input.shift());
    let width = Number(input.shift());
    let height = Number(input.shift());
    let percent = Number(input.shift());

    let volume = (length * width * height)*0.001;

    percent = percent * 0.01;
    let neededWater = volume *(1- percent);

    console.log(neededWater.toFixed(3))
}
fishTank([85,75,47,17]);
/*Аквариум
За рождения си ден Любомир получил аквариум с формата на паралелепипед. 
Първоначално приемаме,като вход размерите му – дължина, широчина и височина в сантиметри. 
Трябва да се пресметне, колко литра вода ще събира аквариума, ако се знае, 
че определен процент от вместимостта му е заета от пясък, растения, нагревател и помпа.
Един литър вода се равнява на един кубичен дециметър/ 1л=1 дм 3 /.
Да се напише програма, която изчислява литрите вода, която са необходими за напълването на аквариума.
Вход
От конзолата се приемат 4 числа:
1. Дължина в см –число в интервала [10 … 500]
2. Широчина в см –число в интервала [10 … 300]
3. Височина в см –число в интервала [10… 200]
4. Процент –число в интервала [0.000 … 100.000]
Изход
Да се отпечата на конзолата едно число:
 литрите вода, които ще събира аквариума, форматирани до третия знак след десетичната запетая.

Примерен вход и изход
Вход 
85
75
47
17


Изход
248.689 

Обяснения
Изчисляваме обем на аквариум:
обем на аквариум= 85*75*47=299625 см 3
общо литри, които ще събере: 299625 * 0.001=299.625 литра
процент: 17*0.01=0.17
литрите, които реално ще трябват : 299.625*(1-0.17) = 248.68875 литра

Вход 
105
77
89
18.5

Изход
586.445

Насоки
6. Приемете, като вход четирите числа .
7. Създайте променлива, която записва резултата за обема на аквариума.
8. Създайте още една променлива, която записва резултата за общите литри, които аквариумът ще
събере.
9. Изчислете процентите.
10. Накрая създайте още една променлива, която записва литрите, които реално ще трябват.
11. Изведете резултата на конзолата, като форматирате до третия знак след десетичната запетая.*/