function greatingByName(input){
    let name = input.shift();

    console.log(`Hello, ${name}!`);
    
}
greatingByName(["Maria"]);
/*Поздрав по име
Напишете програма, която изважда от аргумента input име на човек и отпечатва "Hello, "name"!", където
"name"; е въведеното име от конзолата.
  Създайте променливата name и запазете в нея името, което се подава от (input).За да извадим данните,
които се съдържат в input ще използваме функцията shift()
Изведете изхода на конзолата, като използвате следния шаблон:

Как работи примерът? Методът console.log() ни позволява в кръглите скоби да записваме поредица от
символи, които държат в себе си стойността на дадена променлива – ${name} и я принтира на конзолата.
Забележете, че за да работи текстът трябва да е ограден от символа ` , който разпознава обикновен текст и
променлива. За да бъде разпозната една променлива, като такава, тя трябва да започва със символа $ и да
бъде оградена в къдрави скоби : { } .
1. Стартирайте програмата с Ctrl + F5 и тествайте с различни входни примери.
2. За да получим резултат трябва да &quot;повикаме&quot; функцията и да й подадем входни данни:*/