function movieStars(input) {

    let budget = +input.shift();

    let nameActor = input.shift();

    while ("ACTION" != nameActor) {

        if (nameActor.length > 15) {
            budget -= budget * 0.2;
        } else {
            let salary = +input.shift();
            budget -= salary;
        }

        if (budget < 0) {
            break;
        }

        nameActor = input.shift();
    }

    if ("ACTION" == nameActor) {
        console.log(`We are left with ${budget.toFixed(2)} leva.`);
    } else {
        console.log(`We need ${Math.abs(budget).toFixed(2)} leva for our actors.`);
    }
}
movieStars([90000, "Christian Bale", 70000.50, "Leonard DiCaprio", "Kevin Spacey", 24000.99]);
movieStars([170000, "Ben Affleck", 40000.50, "Zahari Baharov", 80000, "Tom Hanks", 2000.99, "ACTION"]);

/*Задача 4. Кинозвезди
Счетоводителят на киноцентър "Тинтява 15" ви наема да напишете програма,
която пресмята хонорарите за актьорите.
 Всяка продукция има бюджет за актьори.
 До команда "ACTION" ще получавате име на актьор и възнаграждението му.
 Ако името на актьора е по-дълго от 15 символа възнаграждението му ще е 20 % от останалия бюджет до момента.
  Ако бюджета в даден момент свърши, програмата трябва да прекъсне.
Вход
От конзолата първо се чете един ред:
    • Бюджет за актьори - реално число в интервала [1000.0... 2 100 000.0]
След това се четат многократно по един или два реда до команда "ACTION" или до изчерпване на бюджета:
    • Име на актьор - текст
Ако името на актьора съдържа по-малко или равно на 15 брой символи:
        ◦ Възнаграждение - реално число в интервала [250.0… 1 000 000.0]
Изход
На конзолата да се отпечата един ред:
    • Ако бюджета е достатъчен :
             "We are left with {останал бюджет} leva."
    • Ако бюджета не е достатъчен:
	"We need {необходим бюджет} leva for our actors."
Резултата да се форматира до втората цифра след десетичния знак!
Примерен вход и изход

Вход
90000
Christian Bale
70000.50
Leonard DiCaprio
Kevin Spacey
24000.99

Изход
We need 8001.39 leva for our actors.

Обяснения
Бюджета е 90000
След заплатата на първият актьор: 70000.50
Бюджета е 19999.5
Името на втория актьор е по-дълго от 15 символа => 20% от 19999.5 = 3999.9
Бюджета е 15999.6 след вторият актьор.
Последната заплата е 24000.99
=> 15999.6 – 24000.99 = - 8001.39
Бюджета не е недостатъчен.

Вход
170000
Ben Affleck
40000.50
Zahari Baharov
80000
Tom Hanks
2000.99
ACTION

Изход
We are left with 47998.51 leva.


*/