function movieTickets(input) {
    let a1 = input.shift();
    let a2 = input.shift();
    let n = input.shift();

    for (let i = a1; i < a2; i++) {
        for (let j = 1; j < n; j++) {
            for (let k = 1; k < n / 2; k++) {
                if (i % 2 != 0 && (j + k + i) % 2 != 0) {
                    console.log(`${String.fromCharCode(i)}-${j}${k}${i}`);
                }
            }
        }
    }
}

//movieTickets([86,88,4]);
movieTickets([71, 74, 6]);
//movieTickets([69,72,4]);
/*Задача 6. Билети за филм
Трябва да напишете програма, която чете три цели числа  a1, a2, n въведени от потребителя и
генерира номера за билети, които се състоят от следните 4 символа:
    • Символ 1: символ с ASCII код от а1 до а2 - 1
    • Символ 2: цифра от 1 до n - 1
    • Символ 3: цифра от 1 до n / 2 - 1
    • Символ 4: цифрова репрезентация (ASCII код) на символ 1
След като са изпълнени условията се генерира следния билет:
"{Символ 1}-{Символ 2}{Символ 3}{Символ  4}"
Вход
    • a1 – цяло число в интервала [65… 89]
    • a2 – цяло число в интервала [66… 91]
    • n – цяло число в интервала [1… 10]
Изход
На конзолата трябва да се отпечатат всички билетни номера,
на които числовата репрезентация на
символ 1 е нечетна и сборът на символ 2, символ 3 и символ 4 е нечетен.
Примерен вход и изход

Вход
86
88
4

Изход
W-1187
W-3187

Обяснения
Символ 1 в началото е W(ASCII код 87);
Символ 2  =  1;
Символ 3  = 1;
Символ 4 = 87;
Проверяваме дали Символ 1 e нечетен.
Сборът от Символ 2  + Символ 3 + Символ 4 = 89 също е  нечетен.
Генериран билет:  W-1187 и продължаваме с генериране на следващи билети.


Вход
71
74
6

Изход
G-1171
G-2271
G-3171
G-4271
G-5171
I-1173
I-2273
I-3173
I-4273
I-5173


Вход
69
72
4

Изход
E-1169
E-3169
G-1171
G-3171

*/