function bonusScore(input){
    let numer = Number(input.shift());
    let bonusPoints = 0;
    if (numer <= 100){
        bonusPoints += 5;
    }
     if(numer > 100){
        bonusPoints = numer * 0.20;
    }
     if (numer > 1000){
        bonusPoints = numer * 0.10;
    }
    if (numer % 2 === 0){
        bonusPoints +=  1;
    }
    if (numer % 10 == 5){
        bonusPoints += 2;
    }
    console.log(bonusPoints);
    console.log(bonusPoints + numer);
    }
bonusScore([20]);
bonusScore([175]);
bonusScore([2703]);
bonusScore([15875]);
/*Бонус точки
Дадено е цяло число – начален брой точки. 
Върху него се начисляват бонус точки по правилата, описани по-долу. 
Да се напише програма, която пресмята бонус точките, 
които получава числото и общия брой точки(числото + бонуса).
 Ако числото е до 100 включително, бонус точките са 5.
 Ако числото е по-голямо от 100, бонус точките са 20% от числото.
 Ако числото е по-голямо от 1000, бонус точките са 10% от числото.
 Допълнителни бонус точки (начисляват се отделно от предходните):
o За четно число -> + 1 т.
o За число, което завършва на 5 -> + 2 т.

Примери:

вход 
20 
изход
6
26


вход
175 
изход
37
212


вход
2703 
изход
270.3
2973.3

вход
15875 
изход
1589.5
17464.5

           */