function scholarship(input){

    let income = Number(input.shift());
    let averageGrade = Number(input.shift());
    let minSalary = Number(input.shift());

    let socialScholarship = minSalary * 0.35;;
    let scholarship = averageGrade * 25;;
    
    if (averageGrade >= 5.5) {
        if (scholarship >= socialScholarship || income > minSalary) {
            console.log(`You get a scholarship for excellent results ${Math.floor(scholarship)} BGN`);
                
        } else {

            console.log(`You get a Social scholarship ${Math.floor(socialScholarship)} BGN`);

        }
    } else if (income < minSalary && averageGrade > 4.5) {
        console.log(`You get a Social scholarship ${Math.floor(socialScholarship)} BGN`);
    }
    else{
        console.log("You cannot get a scholarship!");
    }
}
scholarship([480.00,4.60,450.00]); 
/*scholarship([300.00,5.65,420.00]); */

/**Стипендии
Учениците могат да кандидатстват за социална стипендия или за стипендия за отличен успех. 
Изискване за социална стипендия - доход на член от семейството по-малък от минималната работна заплата 
и успех над 4.5. Размер на социалната стипендия - 35% от минималната работна заплата. 
Изискване за стипендия за отличен успех - успех над 5.5, включително. 
Размер на стипендията за отличен успех - успехът на ученика,умножен по коефициент 25.
Напишете програма, която при въведени доход, успех и минимална работна заплата, дава информация дали
ученик има право да получава стипендия, и стойността на стипендията, която е по-висока за него.
Вход
Потребителят въвежда 3 числа, по едно на ред:
1. Доход в лева - реално число в интервала [0.00..6000.00]
2. Среден успех - реално число в интервала [2.00...6.00]
3. Минимална работна заплата - реално число в интервала [0.00..1000.00]
Изход

 Ако ученикът няма право да получава стипендия, се извежда:
"You cannot get a scholarship!"
 Ако ученикът има право да получава социална стипендия и тя е по-висока от стипендията за отличен
успех:
"You get a Social scholarship {стойност на стипендия} BGN"
 Ако ученикът има право да получава стипендия за отличен успех и тя е по-висока или равна по
стойност на социалната стипендия за него:
 "You get a scholarship for excellent results {стойност на стипендията} BGN"
Резултатът се закръгля до по-малкото цяло число.
Примерен вход и изход
Вход 
480.00
4.60
450.00

Изход
You cannot get a
scholarship!

Обяснения
Доходът от 480 лв. е по-висок от минималната работна
заплата 450 лв. → ученикът не може да получава
социална стипендия.
Успех 4.60 < 5.50 → ученикът не може да получава
стипендия за отличен успех.

Вход
300.00
5.65
420.00

Изход
You get a Social
scholarship 147 BGN

Обяснения
300 лв. < 420 лв. и 5.65 > 4.50 → ученикът може да
получава социална стипендия 35% * 420 лв. = 147 лв.
Успех 5.65 > 5.50 → ученикът може да получава
стипендия за отличен успех 5.65 * 25 = 141.25 лв.
147 лв. > 141.25 лв. → ученикът ще получава социална
стипендия.
                 */