function worldSwimmingRecord(input){
    let worldRecordInSeconds = Number(input.shift());
    let distanceInMeters = Number(input.shift());
    let timeInSecondsForMeter = Number(input.shift());
    let timeIvan = distanceInMeters * timeInSecondsForMeter;

    let  delay = Math.floor(distanceInMeters / 15) * 12.5;

    let timeForWorldRecord = (timeIvan + delay);

    let shortageTime = Math.abs(worldRecordInSeconds - timeForWorldRecord);

    if(timeForWorldRecord < worldRecordInSeconds){
        console.log(`Yes, he succeeded! The new world record is ${timeForWorldRecord.toFixed(2)} seconds.`)
    }
    else{
        console.log(`No, he failed! He was ${shortageTime.toFixed(2)} seconds slower.`)
    }



}
worldSwimmingRecord([10464,1500,20]); 
worldSwimmingRecord([55555.67,3017,5.03]);

/*7. Световен рекорд по плуване
Иван решава да подобри Световния рекорд по плуване на дълги разстояния. На конзолата се въвежда
рекордът в секунди, който Иван трябва да подобри, разстоянието в метри, което трябва да преплува и
времето в секунди, за което плува разстояние от 1 м. 
Да се напише програма, която изчислява дали се е справил със задачата, като се има предвид, че: 
съпротивлението на водата го забавя на всеки 15 м. с 12.5 секунди. 
Когато се изчислява колко пъти Иванчо ще се забави, в резултат на съпротивлението на водата,
резултатът трябва да се закръгли надолу до най-близкото цяло число.
Да се изчисли времето в секунди, за което Иванчо ще преплува разстоянието и разликата спрямо
Световния рекорд.
 От конзолата се четат 3 реда:
1. Рекордът в секунди – реално число в интервала [0.00 … 100000.00]
2. Разстоянието в метри – реално число в интервала [0.00 … 100000.00]
3. Времето в секунди, за което плува разстояние от 1 м. - реално число в интервала [0.00 … 1000.00]
Изход
Отпечатването на конзолата зависи от резултата:
 Ако Иван е подобрил Световния рекорд отпечатваме:
o "Yes, he succeeded! The new world record is {времето на Иван} seconds."
 Ако НЕ е подобрил рекорда отпечатваме:
o "No, he failed! He was {недостигащите секунди} seconds slower."

Резултатът трябва да се форматира до втория знак след десетичната запетая.
Примерен вход и изход
Вход  
10464
1500
20

Изход
No, he failed! He was
20786.00 seconds slower.

Обяснения
Иван трябва да преплува 1500 м.: 1500 * 20 = 30000 сек.
На всеки 15 м. към времето му се добавят 12.5 сек.:
1500 / 15 = 100 * 12.5 = 1250 сек.
Общо време: 30000 + 1250 = 31250 сек.
10464 < 31250
Времето, което не му е стигнало за да подобри рекорда:
31250 – 10464 = 20786 сек.

Вход  
55555.67
3017
5.03

Изход
Yes, he succeeded! The
new world record is
17688.01 seconds.

Обяснения
Иван трябва да преплува 3017 м.: 3017 * 5.03 = 15175.51 сек.
На всеки 15 м. към времето му се добавят 12.5 сек.:
3017/ 15 = 201 * 12.5 = 2512.50 сек.
Общо време: 15175.51 + 2512.50 = 17688.01 сек.
Рекордът е подобрен: 55555.67 > 17688.01          */