function lemonadeStand(input) {
    
   
    let lemonKg = +input.shift();
    let sugarKg = +input.shift();
    let water = +input.shift()* 1000;
    let lemonJuice = lemonKg * 980;
    let lemonade = lemonJuice + water;
         lemonade += sugarKg * 0.3;
    let cups = Math.floor(lemonade / 150);
    let finalPrice = cups * 1.2;

    console.log(`All cups sold: ${Math.floor(cups)}`);
    console.log(`Money earned: ${finalPrice.toFixed(2)}`);
    
}

lemonadeStand([5, 3.5, 5]);
/*Задача 1. Щанд за лимонада
Ани решила да спести пари за лятната си почивка като продава лимонада.
За направата на лимонадата се използват определено количество лимони, захар и вода,
като се знае че от един килограм лимони стават 980 мл. лимонов сок, а след разтварянето на захарта
във водата и сока, сместа се увеличава с 30% от теглото на захарта.

 След като направи лимонадата, Ани я продава в чаши от по 150 мл.
Напишете програма, която изчислява колко чаши с лимонада е продала Ани и каква е нейната печалба,
като имате предвид, че цената за една чаша е 1.20 лв.
ЗАБЕЛЕЖКА: При изчисляването на броя на чашите да се закръгли към по-малкото цяло число.
Вход
От конзолата се четат 3 реда:
    • Първи ред – килограмите лимони. Реално число в интервала [1.00…1000.00]
    • Втори ред – килограмите захар. Реално число в интервала [1.00…100.00]
    • Трети ред – литрите вода. Реално число в интервала [1.00…1000.00]
Изход
На конзолата се отпечатват два реда:
    • "All cups sold: {броят на продадените чаши с лимонада}"
    • "Money earned: {спечелената сума}"
Сумата да се форматира до втората цифра след десетичния знак.
Примерен вход и изход
Вход
5
3.5
5

Изход
All cups sold: 66
Money earned: 79.20

Обяснения
5 * 980 = 4900 – общото количество на милилитрите лимонов сок.
4900 + 5 * 1000 + (30% от 3.5) = 9901.05 – общото количество лимонада,
получено от сбора на сока в мл., водата в мл. и 30% от захарта
9901.05 / 150 = 66 – броят на продадените чаши
66 * 1.20 = 79.20 – спечелената сума от продажбата


Вход
250
20
100

Изход
All cups sold: 2300
Money earned: 2760.00

Вход
85
17.5
35

Изход
All cups sold: 788
Money earned: 945.60
*/