function reservation(input){

    let dayReservation = +input[0];
    let monthReservation = +input[1];
    let dayArrival = +input[2];
    let monthArrival = +input[3];
    let dayDeparture = +input[4];
    let monthDeparture = +input[5];

    let priceNight = 0;
    let nights = dayDeparture - dayArrival;

    let differenceDays = (dayArrival - dayReservation);
    if(differenceDays > 10){
        priceNight = 25;
    }else {
        priceNight = 30;
    }
   
    if(monthReservation != monthArrival){
        priceNight = 25 * 0.80;
    }
    let totalPrice = priceNight * nights;
    console.log(`Your stay from ${dayArrival}/${monthArrival} to ${dayDeparture}/${monthDeparture} will cost ${totalPrice.toFixed(2)}`);
}
reservation([21,7,28,8,30,8]);
/*Задача 2. Резервация
Деси разглежда оферти за престой по време на почивката си. 
Намира подходящо място за престой със следните условия:
• Нощувката за двойна стая струва 30лв
    ◦ Ако резервацията бъде направена поне 10 дена по-рано, цената е 25лв
• Ако резервацията бъде направена от предходен месец се начислява 20% отстъпка и цената на нощувката е 25лв
Напишете програма, която според деня и месеца на резервацията, деня на настаняване и деня на напускане на хотела изчислява сумата, 
която Деси трябва да заплати. 
Почивката на Деси няма да започва през един месец и да приключва през друг.
Вход
    • Първи ред – ден, в който е направена резервацията – цяло число в интервала от [1… 31]
    • Втория ред – месец, в който е направена резервацията – цяло число в интервала от [1... 12]
    • Трети ред – ден за настаняване – цяло число в интервала от [1... 30]
    • Четвърти ред – месец за настаняване – цяло число в интервала от [1... 12]
    • Пети ред – ден за напускане на стаята – цяло число в интервала от [1... 31]
    • Шести ред – месец за напускане на стаята – цяло число в интервала от [1... 12]
Изход
"Your stay from {1}/{2} to {3}/{4} will cost {5}"
Където:
    • 1 – ден за настаняване
    • 2 – месец за настаняване
    • 3 – ден за напускане на стаята
    • 4 – месец за напускане на стаята
    • 5 – сума за престоя, форматирана до втория знак след десетичната запетая
Примерен вход и изход
Вход
21
7
28
8
30
8

Изход
Your stay from 28/8 to 30/8 will cost 40.00

Обяснения
Денят на резервацията е 21-ви, а месецът 7-ми.. Нощувките са 2 (30 - 28).
Тъй като резервацията е направена предходен месец, нощувките се начисляват с цена 25лв и има 20% отстъпка.
2 х 25 = 50лв
50 – 20% = 40лв крайна цена


Вход
10
5
15
5
18
5

Изход
Your stay from 15/5 to 18/5 will cost 90.00

Обяснения
Денят на резервацията е 10-ти, а месецът 5-ти. Нощувките са 3.
Тъй като резервацията е направена същия месец и не повече от 10 дни по-рано, нощувките се начисляват с цена 30лв и няма отстъпка.
3 х 30 = 90лв крайна цена

Вход
20
10
5
11
10
11

Изход
Your stay from 5/11 to 10/11 will cost 100.00

Обяснения
Денят на резервацията е 20-ти, а месецът 10-ти. Нощувките са 5. (10 - 5)
Тъй като резервацията е направена предходен месец, нощувките се начисляват с цена 25лв и има 20% отстъпка.
5 х 25 = 125лв 
125 – 20% = 100лв крайна цена
*/