function savings(input){
    let salary = +input[0];
    let months = +input[1];
    let costs = +input[2];

    let unforeseenCosts = salary * 0.30;
    let sumToSaves = salary - (costs + unforeseenCosts);
    let allSaves = sumToSaves * months;

    let percent = (sumToSaves / salary)* 100;

console.log(`She can save ${percent.toFixed(2)}%`);
console.log(`${allSaves.toFixed(2)}`);
}
savings([1500,3,800]);
/*Задача 1.Спестявания 
Деси иска да посети голям музикален фестивал това лято. 
Тя трябва да започне да спестява част от дохода си, за да успее да заплати разходите по пътуването й до там.
Напишете програма, която да изчисли максимално колко процента от дохода си може да спестява Деси, 
за да посети фестивала.

Всеки месец, Деси има нужда от определена сума пари, 
за да покрие личните си разходи за месеца, а 30% от дохода си ще запази за непредвидени разходи.

Вход
От конзолата се четат 3числа:
1.Първи ред – дохода на Деси за месец – реалночисло в интервала[1500.00...10 000.00]
2.Втори ред – броят месеци, с които Деси разполага, за да спести парите – цяло число в интервала [3... 12]
3.Трети ред – сумата, от която Деси има нужда, за да покрие личните си разходи – реално число в интервала [300.00... 1000.00]
Изход
На конзолата да се отпечатат два реда:
•"She can save{максимален процент от дохода си, който може да спести}%" 
•"{сумата, която ще успее да спести}"Всички числа трябва да бъдатформатиранидо втората цифра след десетичния знак.
Примерен вход и изход
Вход
1500
3
800


Изход
She can save 16.67%
750.00


Обяснения
Сумата нужна на Деси, за да покрие личните си разходи 
и да задели пари за непредвидени ситуации е равна на:30% от 1500 лв.= 450лв.
Сумата, която ще спестява всеки месец е : 1500 –(800 + 450) = 250лв.
За 3 месеца, тя ще спести 3х250лв = 750лв., което е 250/1500 = 16.67процента от дохода на Деси


Вход
2050
5
900

Изход
She can save 26.10%
2675.00

Вход
3500
3
997

Изход
She can save 41.51%
4359.00
*/