function seats(input){
    let numTickets = +input.shift();
    for (let i = 0; i < numTickets; i++) {
        let numTickets = input.shift();
        let lengthTicket = numTickets.length;

        let seat = "";
        if (lengthTicket == 4) {
            let firstChar = numTickets.charAt(0);
            if (firstChar >= 'A' && firstChar <= 'Z') {
                seat += firstChar;
            } else {
                seat += numTickets.charAt(3);
            }
            seat += numTickets.charAt(1);
            seat += numTickets.charAt(2);
        } else if (lengthTicket === 6 || lengthTicket === 5) {
            seat += numTickets.charAt(0);
            seat += numTickets.charCodeAt(1);
        }

        console.log(`Seat decoded: ${seat}`);
    }
}

seats([3,"042W","W981","W24578"]);
/*Задача 5. Места на концерт
Деси е купила няколко билета за концерт, на които обаче не са споменати местата в залата, за които са закупени. 
Тя вижда зависимост между различния формат на билетните номера. 
Местата, на които отговарят билетите се образуват според следните правила и формат:
- Номер с 4 символа
-  Ако първия символ е главна буква от латинската азбука: 
   {първи символ} {втори символ} {трети символ}
    • Ако първия символ не е главна буква от латинската азбука: 
   {четвърти символ} {втори символ} {трети символ}
- Номер с 5 или 6 символа – {първи символ} {ASCII стойността на втория символ} 
Напишете програма, която да помогне на Деси да разшифрова билетните номера.
Вход
    • Първи ред – брой билети, които Деси е закупила – цяло число в интервала от [2… 100]
    • За всеки билет чете билетния номер – текст. 
Изход
Да се отпечата разшифрования номер на място за всеки билет във формат:

"Seat decoded: {номера}"

Примерен вход и изход

Вход
3
042W
W981
W24578

Изход
Seat decoded: W42
Seat decoded: W98
Seat decoded: W50


Обяснения
042W: Номера на билета е 4-символен. 
Първият символ от номера не е главна буква от латинската азбука, 
затова номера на мястото се образува като се долепят символите четвърти, втори и трети.
W981: Номера на билета е 4-символен. 
Първият символ от номера е главна буква от латинската азбука, 
затова номера на мястото се образува като се долепят символите първи, втори и трети.
W24578: Номера на билета е 6-символен. 
Номера на мястото се образува като биват долепени първия символ и ASCII стойността на втория символ – 2 (50).

Вход
4
Y456
Y8909
Y8976
L3472

Изход
Seat decoded: Y45
Seat decoded: Y56
Seat decoded: Y56
Seat decoded: L51


*/