function tripExpenses(input) {
    let days = +input.shift();
    let rest = 0.0;
    for (let i = 0; i < days; i++) {
        let limit = 60 + rest;
        rest = 0;
        let command = input.shift();
        let products = 0;
        while ("Day over" !== command) {
            let price = +command;
            if (limit - price >= 0) {
                limit -= price;
                products++;
            } else {
                command = scan.nextLine();
                continue;
            }
            if (limit == 0) {
                break;
            }
            command = input.shift();
        }
        if ("Day over" == command) {
            rest = Math.abs(rest - limit);
            console.log(`Money left from today: ${rest.toFixed(2)}. You've bought ${products} products.`);
        } else {
            console.log(`Daily limit exceeded! You've bought ${products} products.`);
        }
    }
}




tripExpenses([3, 20, 40, 40, 15, "Day over", 15, 5, 10, 17, 10, "Day over"]);
/*Задача 6. Разходи за почивка
През почивката си Деси харчи парите си за различни неща.
Тя си е сложила лимит до 60 евро на ден.
Напишете програма, чрез която тя да следи разходите си през дните от почивката.
Тя приключва харченето на парите си когато достигне лимита за деня или денят свърши (команда "Day over").
За всеки ден ще се прочитат n на брой пъти цена на продукт, който тя иска да закупи.
    • Ако денят е приключил преди тя да похарчи лимита си за деня,
    то тя ще запази остатъка за следващия ден и ще си позволи да похарчи повече.
    • Ако иска да си купи продукт с цена, с която ще надвиши лимита за деня, тя се игнорира.
Вход
    • Първи ред – продължителността на почивката – брой дни – цяло число в интервала от [2… 100]
След това за всеки ден от почивката до получаване на командата "Day over" или до изчерпване на лимита за деня, се чете по един ред:
    • Цена на продукта – реално число в интервала [0.00… 100.00].
Изход
Всеки път, в който:

    • Лимита разходи е достигнат се принтира текста:
 "Daily limit exceeded! You've bought {броя на закупените продукти} products."
    • Деня свършва преди Деси да е достигнала лимита се принтира:
 "Money left from today: {сумата, която е останала за деня}. You've bought {броя на закупените продукти} products."

Примерен вход и изход

Вход
3
20
40
40
15
Day over
15
5
10
17
10
Day over


Изход
Daily limit exceeded! You've bought 2 products.
Money left from today: 5.00. You've bought 2 products.
Money left from today: 8.00. You've bought 5 products.


Обяснения
Първи ден: начален баланс 60 евро
Закупени са 2 продукта на обща стойност 60 евро, затова Деси спира да харчи за деня.
Втори ден: начален баланс 60 евро
Закупени са два продукта на обща стойност 55 евро. Денят приключва преди да се достигне лимита. За следващия ден остават 5 евро.
Трети ден: начален баланс 65 евро
Закупени са 5 продукта на обща стойност 57 евро. Денят приключва преди да се достигне лимита. Остават 8 евро.


Вход
2
Day over
100
20


Изход
Money left from today: 60.00. You've bought 0 products.
Daily limit exceeded! You've bought 2 products.


Обяснения
Първи ден: Денят приключва преди тя да закупи нещо. Остават 120 евро за следващия ден.
Закупени са 2 продукта на обща стойност 120 евро и лимита е достигнат, затова тя спира да харчи повече.

Вход
2
Day over
130
100
40
20


Изход
Money left from today: 60.00. You've bought 0 products.
Daily limit exceeded! You've bought 2 products.


Обяснения
Първи ден: Деня приключва преди тя да си е купила нещо. Остават й 60 евро от днес.
Втори ден: начален баланс 120 евро
Тя иска да си купи продукт за 130 евро, но има баланс 120, следователно го игнорираме, и продължаваме към следващия.
Купува се продукт за 100 евро.
Игнорира се продукт на цена 40 евро, защото струва повече от останалите й пари.
Купува се продукт за 20 евро и лимита е достигнат, затова тя спира да харчи повече.

*/