function footballTournament(input) {
    nameTeam = input.shift();
    numMatches = +input.shift();

    let points = 0;
    let wins = 0;
    let draw = 0;
    let loss = 0;

   for(let i = 0; i <= numMatches; i++) {
        let result = input.shift();
        if (result == 'W') {
            points += 3;
            wins++;
        } else if (result == 'D') {
            points += 1;
            draw++;
        } else if (result == 'L') {
            loss++;
        }
    }
    let percentWins = wins*1.0 / numMatches*100;
    if(numMatches === 0){
        console.log(`${nameTeam} hasn't played any games during this season.`);
        return;
    }
    else{
        console.log(`${nameTeam} has won ${points} points during this season.`);
        console.log("Total stats:");
        console.log(`## W: ${wins}`);
        console.log(`## D: ${draw}`);
        console.log(`## L: ${loss}`);
        console.log(`Win rate: ${percentWins.toFixed(2)}%`)

    }
}

footballTournament(["Liverpool", 10, "W", "D", "D", "W", "L", "W", "D", "D", "W", "W"]);
footballTournament(["Barcelona", 7, "W", "D", "L", "L", "W", "W", "D"]);
footballTournament(["Chelsea", 0]);
/*Задача 5. Футболно състезание
Задачата ви е да напишете програма, която приема името на отбор и прави статистика за него.
През един сезон всеки отбор изиграва определен брой футболни срещи, като за всяка среща на отбора
се дават точки в зависимост от изхода от срещата. Има три възможни изхода от една среща:
    • W - Отборът е победител и получава 3 точки
    • D - Срещата е завършила без победител и отборът получава 1 точка
    • L - Отборът е загубил срещата и не получава точки
Напишете програма, която приема името на футболен отбор и извежда неговата статистика,
на база на изиграните срещи през този сезон. Неговата статистика трябва да включва общия брой
спечелени точки през настоящия сезон, подробна статистика за изхода на изиграните игри и процент победи през сезона.
Ако отборът по някаква причина не е играл мачове през настоящия сезон се извежда специално съобщение.
Вход
От конзолата се четат два реда:
    • Името на футболния отбор, за който водим статистика - текст
    • Броя изиграни срещи през настоящия сезон - цяло число в интервала [0… 100]
 За всяка изиграна среща се прочита отделен ред:
    • Резултатът от изиграната среща в един от горепосочените формати – символ с възможности 'W', 'D' и 'L'
Изход
В зависимост от това дали отборът е играл мачове през настоящия сезон се извеждат два вида изход.
    • Ако отборът не е изиграл нито един мач през настоящия сезон се извежда точно един ред в следния формат:
        ◦ "{името на отбора} hasn't played any games during this season."
    • Ако отборът е изиграл един мач или повече се извеждат шест реда в следния формат:
        ◦ "{името на отбора} has won {брой спечелени точки} points during this season"
        ◦ "Total stats:"
        ◦ "## W: {брой спечелени игри}"
        ◦ "## D: {брой игри, завършили наравно}"
        ◦ "## L: {брой загубени игри}"
        ◦ "Win rate: {процент спечелени игри}%"
Процентът спечелени игри трябва да бъде форматиран до втората цифра след десетичния знак.
Примерен вход и изход
Вход
Liverpool
10
W
D
D
W
L
W
D
D
W
W

Изход
Liverpool has won 19 points during this season.
Total stats:
## W: 5
## D: 4
## L: 1
Win rate: 50.00%

Обяснения
Името на нашия отбор е Liverpool.
Той изиграва 10 срещи през сезона:
5 победи * 3 точки = 15 точки
4 равенства * 1 точка = 4 точки
1 загуба -> не се прибавят точки
Общ актив след сезона: 19 точки
5 победи от 10 изиграни игри = 50% успеваемост
След закръгляване до втория знак -> 50.00%

Вход
Barcelona
7
W
D
L
L
W
W
D


Изход
Barcelona has won 11 points during this season.
Total stats:
## W: 3
## D: 2
## L: 2
Win rate: 42.86%


Вход
Chelsea
0

Изход
Chelsea hasn't played any games during this season.


Името на отбора е Chelsea.
Той изиграва 0 срещи през сезона (не играе) и затова печатаме специалното съобщение.


*/