function nameGame(input){
    let name = input.shift();
    let bestPoints = 0;
    let winner = "";

    while ("Stop" !== name){
        let currentPoints = 0;
        for (let i = 0; i < name.length; i++) {
            let number = +input.shift();
            if (number == name.charCodeAt(i)) {
                currentPoints += 10;
            } else {
                currentPoints += 2;
            }
        }

        if (currentPoints >= bestPoints) {
            bestPoints = currentPoints;
            winner = name;
        }
        name = input.shift();
    }
            console.log(`The winner is ${winner} with ${bestPoints} points!`);
}


nameGame(["Ivan",73,20,98,110,"Ivo",80,65,87,"Stop"]);
nameGame(["Pesho",124,34,111,97,99,"Gosho",98,124,88,76,18,"Stop"]);

/*Задача 6. Игра на имена
Иван е измислил нова игра в която да се състезава със своите приятели.
 Вашата задача е да напишете програма за играта. 
 Всеки играч написва името си, след това за всяка една буква от името си написва по едно цяло число, 
 ако числото съвпада с ASCII стойността на съответната буква, играчът получава 10 точки,
 в противен случай, получава само 2 точки. Победител е играчът с най-много точки в края на играта.
 В случай, че двама играчи имат равен брой точки, печели този, който втори е достигнал резултата.
Вход
До получаване на командата "Stop" се чете по един ред:
    • Име на играча с дължина n - текст
За всеки играч се четат n на брой реда:
    • число – цяло число в интервала[0…127] 
Изход
Да се отпечата един ред в следния формат:
    • "The winner is {името на победителя} with {точките на победителя} points!"
Примерен вход и изход
Вход
Ivan
73
20
98
110
Ivo
80
65
87
Stop

Изход
The winner is Ivan with 24 points!

Обяснения 
Първият играч е Ivan, дължината на името му е 4 символа, Затова прочитаме 4 числа. 
Първото число е 73,  ASCII стойността на символа 'I'  също е 73, следователно получава 10 точки, 
след това прочитаме 20, но стойността на 'v' е 118, получава 2 точки. 
След това прочитаме 98, но стойността на 'a' е 97, получава 2 точки. 
Последно прочитаме 110, стойността на 'n' също е 110 и затова получава 10 точки, Общо 10 + 2 + 2 + 10 = 24.

Вторият играч е Ivo, прочитаме 3 числа, и трите числа са различни от съответните букви на името, затова Иво получава само 6 точки.
Получаваме командата Stop, печеливш играч е Ivan 

Вход
Pesho
124
34
111
97
99
Gosho
98
124
88
76
18
Stop

Изход
The winner is Gosho with 10 points!

Обяснения 
Първият играч е Pesho, дължината на името е 5.
Прочитаме 5 числа. Нито едно от тях не съответства на конкретната буква, следователно получава 5 пъти по 2 точки, общо 10 и към момента той има най-много.
Вторият играч е Gosho, дължината на името е 5.
Прочитаме 5 числа и отново нито едно от тях не съответства на съответните букви, съответно получава 5 пъти по 2 точки, общо 10.
И двамата играчи имат равен брой точки (10), съответно на първо място остава вторият играч Gosho.
Получаваме командата Stop, печеливш играч е Gosho


*/