function repainting(input){
    let nylonM2 = +input.shift();
    let paintLitres = +input.shift();
    let diluentLitres = +input.shift();
    let hours = +input.shift();
    
    let priceNylon = (nylonM2 + 2)* 1.5;
    let pricePaint = (paintLitres * 1.10) * 14.50;
    let priceDiluent = diluentLitres * 5.00;
    let priceNylonBags = 0.40;
    let allPrice = priceNylon + pricePaint + priceDiluent + priceNylonBags;
    let salaryWorkers = (allPrice * 0.30)* hours;

 let totalPrice = allPrice + salaryWorkers;

    console.log(`Total expenses: ${totalPrice.toFixed(2)} lv.`);
}
repainting([10,11,4,8]);
repainting([5,10,10,1]);
repainting([90,99,28,9]);
/*Задача 1. Пребоядисване
Румен иска да пребоядиса хола, като за целта е наел майстори. Напишете програма, която изчислява разходите за ремонта, 
вземайки предвид следните цени:
    • Предпазен найлон - 1.50 лв. за кв.м.
    • Боя - 14.50 лв. за литър
    • Разредител за боя - 5.00 лв. за литър
За всеки случай, към необходимите материали, Румен иска да добави още 10% от количеството боя и 2 кв.м. найлон, 
разбира се и 0.40 лв. за торбички, а сумата, която се заплаща на майсторите за 1 час работа, е равна на 30% от 
сбора на всички разходи за материали.
Вход
Входът се чете от конзолата и съдържа точно 4 реда:
    1. Необходимо количество найлон (в кв.м.) - цяло число в интервала [1... 100]
    2. Необходимо количество боя (в литри) - цяло число в интервала [1…100]
    3. Количество разредител (в литри) - цяло число в интервала [1…30]
    4. Часовете, за които майсторите ще свършат работата - цяло число в интервала [1…9]
Изход
Да се отпечата на конзолата един ред:
    • "Total expenses: {сумата на всички разходи} lv."
Резултатът трябва да е форматиран до втората цифра след десетичния знак.
Примерен вход и изход
Вход
10
11
4
8

Изход
Total expenses: 727.09 lv.

Обяснения
Необходимото количество найлон е 10 кв.м. Прибавяме още 2 кв.м. и умножаваме по 1.50(цената на найлона).
Необходимото количество боя е 11 литра. Прибавяме още 10%(1.10 литра) и умножаваме по 14.50(цената на боята). 
Необходимото количество разредител е 4 литра. Умножаваме по 5.00(цената на разредителя).
Събираме получените суми и прибавяме парите за торбички 18 + 175.45 + 20 + 0.40 = 213.85(сумата на всички разходи за материали).
 Намираме 30% от сумата, умножаваме по 8(броя часове) и получаваме 513.24(заплатата на майсторите). 
 Прибавяме към тях разходите за материали и получаваме крайния резултат.
(727.09)


Вход
5
10
10
1

Изход
Total expenses: 286.52 lv.


Вход
90
99
28
9


Изход
Total expenses: 6872.57 lv.
*/