function shopping(input){

    let budget = +input.shift();
    let numVideoCard = +input.shift();
    let numProcessor = +input.shift();
    let numRamMemory = +input.shift();

    priceVideoCard = numVideoCard * 250;
    priceProcessor = (priceVideoCard * 0.35)* numProcessor;
    priceRamMemory = (priceVideoCard * 0.10)* numRamMemory;

    let allPrice = priceVideoCard + priceProcessor + priceRamMemory;
    
    if(numVideoCard > numProcessor){
        allPrice = allPrice * 0.85;
    }
    if(budget >= allPrice){
        console.log(`You have ${(budget - allPrice).toFixed(2)} leva left!`);
    }
    else{
        console.log(`Not enough money! You need ${Math.abs(allPrice - budget).toFixed(2)} leva more!`);
    }

}
shopping([900,2,1,3]);
shopping([920.45,3,1,1]);
/*Задача 2. Пазаруване 
Петър иска да купи N видеокарти, M процесора и P на брой рам памет. 
Ако броя на видеокартите е по-голям от този на процесорите получава 15% отстъпка от крайната сметка. 

Важат следните цени:
    • Видеокарта – 250 лв./бр.
    • Процесор – 35% от цената на закупените видеокарти/бр.
    • Рам памет – 10% от цената на закупените видеокарти/бр.
    
Да се изчисли нужната сума за закупуване на материалите и да се пресметне дали бюджета ще му стигне.
Вход
Входът се състои от четири реда:
    1. Бюджетът на Петър - реално число в интервала [0.0…100000.0]
    2. Броят видеокарти - цяло число в интервала [0…100]
    3. Броят процесори - цяло число в интервала [0…100]
    4. Броят рам памет - цяло число в интервала [0…100]
Изход
На конзолата се отпечатва 1 ред, който трябва да изглежда по следния начин:
    • Ако бюджета е достатъчен:
"You have {остатъчен бюджет} leva left!"
    • Ако сумата надхвърля бюджета:
"Not enough money! You need {нужна сума} leva more!"
Резултатът да се форматира до втория знак след десетичната запетая.
Примерен вход и изход

Вход
900
2
1
3

Изход
You have 198.75 leva left!

Обяснения
Петър разполага с бюджет 900 лева.
Купува 2 видеокарти по 250лв., общо 500
Цената на един процесор е 35% от цената на видеокартите. 35% от 500 е 175лв.
Той иска да купи само един процесор.
Цената на един брой рам памет е 10% от цената на видеокартите. 10% от 500 е 50лв.
Петър иска да купи 3 броя рам памет. 
3 * 50 = 150. Общо 500 + 175 + 150 = 825 лв.
Броя на видеокартите е по-голям от броя на процесорите, затова той получава 15% отстъпка от крайната цена.
825 – 15% = 701.25 лв.
701.25 <= 900, парите са му достатъчни и той остава със 198.75лв.

Вход
920.45
3
1
1

Изход
Not enough money! You need 3.92 leva more!

*/