function divideWithoutRemainder(input){
    let n = Number(input.shift());
    let p1 = 0;
    let p2 = 0;
    let p3 = 0;

    for(let i = 0; i < n; i++){
        let numbers = +input.shift();
        if(numbers % 2 == 0){
            p1++;
        }
        if(numbers % 3 == 0){
            p2++;
        } 
        if(numbers % 4 == 0){
            p3++;
        }
    }
    let percentP1 = p1 / n * 100;
    let percentP2 = p2 / n * 100;
    let percentP3 = p3 / n * 100;
    console.log(`${percentP1.toFixed(2)}%`);
    console.log(`${percentP2.toFixed(2)}%`);
    console.log(`${percentP3.toFixed(2)}%`);

}
divideWithoutRemainder([10,680,2,600,200,800,799,199,46,128,65]);
/*divideWithoutRemainder([3,3,6,9]);


/*Деление без остатък


Дадени са n-на брой цели числа в интервала [1…1000]. 
От тях някакъв процент p1 се делят без остатък на 2,
друг процент p2 се делят без остатък на 3, 
друг процент p3 се делят без остатък на 4. 
Да се напише програма, която изчислява и отпечатва процентите p1, p2 и p3.
Пример: имаме n = 10 числа: 680, 2, 600, 200, 800, 799, 199, 46, 128, 65. Получаваме следното разпределение
и визуализация:

Деление без       Числа в диапазона                    Брой числа            Процент
остатък на:       
2                    680, 2, 600, 200, 800, 46, 128       7                 p1 = 7.0 / 10 * 100 = 70.00%
3                    600                                  1                 p2 = 1 / 10 * 100 = 10.00%
4                    680, 600, 200, 800, 128              5                 p3 = 5 / 10 * 100 = 50.00%

Вход
На първия ред от входа стои цялото число n (1 ≤ n ≤ 1000) - брой числа. 
На следващите n реда стои по едно цяло число в интервала [1…1000] – 
числата, които да бъдат проверени на колко се делят.

Изход
Да се отпечатат на конзолата 3 реда, всеки от които съдържа процент между 0% и 100%, с точност две цифри
след десетичната точка, например 25.00%, 66.67%, 57.14%.
 На първият ред - процентът на числата, които се делят на 2
 На вторият ред - процентът на числата, които се делят на 3
 На третият ред - процентът на числата, които се делят на 4
Примерен вход и изход
Вход  
10
680
2
600
200
800
799
199
46
128
65

Изход
70.00%
10.00%
50.00%


Вход
3
3
6
9

Изход
33.33%
100.00%
0.00%

            */
