function histogram(input) {
    let n = +input.shift();
    let p1 = 0;
    let p2 = 0;
    let p3 = 0;
    let p4 = 0;
    let p5 = 0;
    let numbers = 0;
    for (let i = 1; i <= n; i++) {
        numbers = +input.shift();
        if (numbers < 200) {
            p1++;
        } else if (numbers >= 200 && numbers < 400) {
            p2++;
        } else if (numbers >= 400 && numbers < 600) {
            p3++;
        } else if (numbers >= 600 && numbers < 800) {
            p4++;
        } else if (numbers >= 800) {
            p5++;
        }
    }
    let percentP1 = p1 / n * 100;
    let percentP2 = p2 / n * 100;
    let percentP3 = p3 / n * 100;
    let percentP4 = p4 / n * 100;
    let percentP5 = p5 / n * 100;
    console.log(`${percentP1.toFixed(2)}%`);
    console.log(`${percentP2.toFixed(2)}%`);
    console.log(`${percentP3.toFixed(2)}%`);
    console.log(`${percentP4.toFixed(2)}%`);
    console.log(`${percentP5.toFixed(2)}%`);

}


histogram([3, 1, 2, 999]);
histogram([4, 53, 7, 56, 999]);
histogram([7, 800, 801, 250, 199, 399, 599, 799]);
histogram([9, 367, 99, 200, 799, 999, 333, 555, 111, 9]);
histogram([14, 53, 7, 56, 180, 450, 920, 12, 7, 150, 250, 680, 2, 600, 200]);

/*Хистограма
Дадени са n цели числа в интервала [1…1000].
От тях някакъв процент p1 са под 200,
друг процент p2 са от 200 до 399,
друг процент p3 са от 400 до 599,
друг процент p4 са от 600 до 799 и
останалите p5 процента са от 800 нагоре.
Да се напише програма, която изчислява и отпечатва процентите p1, p2, p3, p4 и p5.
Пример: имаме n = 20 числа: 53, 7, 56, 180, 450, 920, 12, 7, 150, 250, 680, 2, 600, 200, 800, 799, 199, 46, 128, 65.
Получаваме следното разпределение и визуализация:

Диапазон     Числа в диапазона                                    Брой числа                   Процент
< 200        53, 7, 56, 180, 12, 7, 150, 2, 199, 46, 128, 65        12                       p1 = 12 / 20 * 100 = 60.00%
200 … 399    250, 200                                                2                       p2 = 2 / 20 * 100 = 10.00%
400 … 599    450                                                     1                       p3 = 1 / 20 * 100 = 5.00%
600 … 799    680, 600, 799                                           3                       p4 = 3 / 20 * 100 = 15.00%
≥ 800        920, 800                                                2                       p5 = 2 / 20 * 100 = 10.00%
Вход
На първия ред от входа стои цялото число n (1 ≤ n ≤ 1000) – брой числа. На следващите n реда стои по едно
цяло число в интервала [1…1000] – числата върху които да бъде изчислена хистограмата.
Изход
Да се отпечата на конзолата хистограмата – 5 реда, всеки от които съдържа число между 0% и 100%, с точност
две цифри след десетичната точка, например 25.00%, 66.67%, 57.14%.
Примерен вход и изход
Вход
3
1
2
999

Изход
66.67%
0.00%
0.00%
0.00%
33.33%

Вход
4
53
7
56
999

Изход
75.00%
0.00%
0.00%
0.00%
25.00%

Вход
7
800
801
250
199
399
599
799

Изход
14.29%
28.57%
14.29%
14.29%
28.57%

Вход
9
367
99
200
799
999
333
555
111
9

Изход
33.33%
33.33%
11.11%
11.11%
11.11%

Вход
14
53
7
56
180
450
920
12
7
150
250
680
2
600
200

Изход
57.14%
14.29%
7.14%
14.29%
7.14%
               */