function charityCampaign(input){
    let numDaysOfCampaign = Number(input.shift());
    let numConfectioner = Number(input.shift());
    let numCakes = Number(input.shift());
    let numWaffles = Number(input.shift());
    let numPancakes = Number(input.shift());

    let priceCakes = 45;
    let priceWaffles = 5.80;
    let pricePancakes = 3.20;

    let produceForDayOfOneConfectioner = (numCakes*priceCakes) + (numWaffles * priceWaffles) + (numPancakes * pricePancakes);
    let allProduce = produceForDayOfOneConfectioner * numConfectioner * numDaysOfCampaign;

    let charityMoney = allProduce - (allProduce/8);
    console.log(charityMoney.toFixed(2));
}
charityCampaign([20,8,14,30,16]);

/*Благотворителна кампания
В сладкарница се провежда благотворителна кампания за събиране на средства, в която могат да се включат
сладкари от цялата страна. 
Първоначално прочитаме от конзолата броя на дните, в които тече кампанията и
броя на сладкарите, които ще се включат. 
След това на отделни редове получаваме количеството на
тортите, гофретите и палачинките, които ще бъдат приготвени от един сладкар за един ден. 
Трябва да се има предвид следния ценоразпис:
 Торта - 45 лв.
 Гофрета - 5.80 лв.
 Палачинка – 3.20 лв.
1/8 от крайната сума ще бъде използвана за покриване на разходите за продуктите по време на
кампанията. Да се напише програма, която изчислява сумата, която е събрана в края на кампанията.
Вход
От конзолата се четат 5 реда:
1. Броят на дните, в които тече кампанията – цяло число в интервала [0 … 365]
2. Броят на сладкарите – цяло число в интервала [0 … 1000]
3. Броят на тортите – цяло число в интервала [0… 2000]
4. Броят на гофретите – цяло число в интервала [0 … 2000]
5. Броят на палачинките – цяло число в интервала [0 … 2000]
Изход
Да се отпечата на конзолата едно число:
 парите, които са събрани, форматирани до втория знак след десетичната запетая.
Примерен вход и изход
Вход Изход 
20
8
14
30
16

Изход
119728.00

Обяснения
Изчисляваме сумата, която се изкарва на ден за всеки един от продуктите,направени от 1 сладкар:
Торти: 14 * 45 = 630 лв.;
Гофрети: 30 * 5.80 = 174 лв.;
Палачинки: 16 * 3.20 = 51.20 лв.
Обща сума за един ден: (630 + 174 + 51.20) * 8 = 6841.60 лв.
Сума събрана от цялата кампания: 6841.60 * 20 = 136832лв.
Сума след покриване на разходите: 136832 - 1/8 от 136832 = 119728 лв.

Вход 
131
5
9
33
46

Изход
426175.75

Насоки:
1. Прочетете входа от конзолата и инициализирайте променливи.
2. Създайте променливи с подходящо име, в които да запазите резултатите от изчисленията за общия
брой торти, гофрети и палачинки.
3. Изчислете общата сума за един ден.
4. Изчислете общата сума събрана от цялата кампания.
5. Накрая изчислете сумата след покриването на разходите и принтирайте резултата на конзолата, като
го форматирате до втория знак след десетичната запетая.*/