function danceHall(input){
   
    let length = Number(input.shift());
    let width = Number(input.shift());
    let wardrobe = Number(input.shift());

    let areaHall = (length * 100)* (width * 100);
    let areaBench = areaHall/10;
    let areaWardrobe = (wardrobe * 100) * (wardrobe * 100);

    let freeSpace = areaHall - areaBench - areaWardrobe;
    let numDancer = freeSpace/(40 + 7000);

    console.log(Math.floor(numDancer));
}
danceHall([50,25,2]);

/*Зала за танци
Група танцьори си търсят нова зала. 
Залата, която са харесали, е правоъгълна и има размери:
L - дължина и W - ширина (в метри). 
В залата има квадратен гардероб със страна - A и правоъгълна скамейка
с площ 10 пъти по-малка от площта на залата.
Мястото, което заема един танцьор е 40 см² и допълнително за свободно движение му трябват още 7000см².
Напишете програма, която да изчислява колко танцьори могат да се поберат в залата и да се движат свободно.
Полученият резултат трябва да се закръгли до най-близкото цяло число надолу.
Вход
От конзолата се четат 3 реда:
1. L – дължина на залата в метри – реално число в интервала [10.00 … 100.00]
2. W – ширина на залата в метри – реално число в интервала [10.00 … 100.00]
3. А – страна на гардероба в метри – реално число в интервала [2.00… 20.00]
Изход
Да се отпечата на конзолата едно цяло число – броя танцьори, които могат да се поберат в свободното
пространство на залата, закръглени до най-близкото цяло число надолу.
Примерен вход и изход
Вход   
50
25
2

Изход
1592 

Обяснения
Големина на залата в квадратни сантиметри: (50 * 100) * (25 * 100) = 12 500 000;
Големина на гардероба: (200 * 200) = 40000;
Големина на пейката: 12 500 000 / 10 = 1 250 000;
Свободно пространство = 12 500 000 – 40000 – 1 250 000 = 11210000;
Брой танцьори = 11210000 / (40 + 7000) = 1592;

Насоки:
1. Приемете входа от конзолата и инициализирайте необходимите променливи:

2. Създайте три нови променливи с подходящо име, в които да запазите резултатите от изчисленията за
площта на залата, гардероба и пейката.

3. Изчислете свободното пространство.
4. Изчислете броя танцьори, които могат да се поберат в свободното пространство на залата,
закръглени до най-близкото цяло число надолу. Използвайте Math.Floor().*/