function tailoringWorkshop(input){

    let numTables = Number(input.shift());
    let lengthTables = Number(input.shift());
    let widthTables = Number(input.shift());

    let allCovers = (lengthTables + 2 * 0.30) * (widthTables + 2 * 0.30) * numTables;
    let allCoverSquare = (lengthTables/2) * (lengthTables/2)*numTables;
    let priceCover = allCovers * 7;
    let priceCoverSquare = allCoverSquare * 9 ;

    let priceUsd = (priceCover + priceCoverSquare) * 1.85;
    let priceBgn = priceCover + priceCoverSquare;
    
    console.log(`${priceBgn.toFixed(2)} USD`);
    console.log(`${priceUsd.toFixed(2)} BGN`);


}
tailoringWorkshop([5,1.00,0.50]);
tailoringWorkshop([10,1.20,0.65]);

/*Шивашки цех
Шивашки цех приема поръчки за ушиване на покривки и карета за маси за заведения. 
Покривките са правоъгълни, каретата са квадратни, броят им винаги е еднакъв. 
Покривката трябва да виси с 30 см от всеки ръб на масата. 
Страната на каретата е половината от дължината на масите. 
Във всяка поръчка се включва информация за броя и размерите на масите.
Напишете програма, която пресмята цената на поръчка в долари и в левове, като квадратен метър плат за
правоъгълна покривка струва 7 долара, а за каре – 9 долара. Курсът на долара е 1.85 лева.
Вход
Потребителят въвежда 3 числа:
 Брой правоъгълни маси – цяло число в интервала [0...500]
 Дължина на правоъгълните маси в метри – реално число в интервала [0.00...3.00]
 Широчина на правоъгълните маси в метри – реално число в интервала [0.00...3.00]
Изход
Да се отпечатат на конзолата две числа: цената на изделията в долари и в левове.
o "{цена в долари} USD"
o "{цена в левове} BGN"
Резултатите да се закръглят до два знака след десетичната запетая.
Примерен вход и изход
Вход  
5
1.00
0.50

Изход
72.85 USD
134.77 BGN

Обяснения
Общата площ на покривките е:
5 броя * (1.00 + 2 * 0.30) * (0.5 + 2 * 0.30) = 8.80 кв. метра
Общата площ на каретата е:
5 броя * (1.00 /2 ) * (1.00 / 2) = 1.25 кв. метра
Цена в долари: 8.80 * 7 долара + 1.25 * 9 долара = 72.85 долара
Цена в левове: 72.85 * 1.85 = 134.77 лева

10
1.20
0.65

Изход
189.90 USD
351.32 BGN

Обяснения
Общата площ на покривките е:
10 броя * (1.2 + 2 * 0.30) * (0.65 + 2 * 0.30) = 22.50 кв. метра
Общата площ на каретата е:
10 броя * (1.20 /2 ) * (1.20 / 2) = 3.60 кв. метра
Цена в долари: 22.50 * 7 долара + 3.60 * 9 долара = 189.9 долара
Цена в левове: 189.9 * 1.85 = 351.32 лева

                                        */