function uSDtoBGN(input){

    let usd = Number(input.shift());

    let bgn = usd * 1.79549;
    console.log(bgn.toFixed(2));

}
uSDtoBGN([20]);
uSDtoBGN([100]);
uSDtoBGN([12.5]);
/*Конзолен конвертор: USD към BGN
Напишете програма за конвертиране на щатски долари (USD) в български лева (BGN). Закръглете резултата
до 2 цифри след десетичната запетая. Използвайте фиксиран курс между долар и лев: 1 USD = 1.79549 BGN.
Примерен вход и изход
вход  
20 
изход
35.91 

вход
100 
изход
179.55 

вход
12.5 
изход
22.44


Насоки
1. Създайте променливата usd, която приема като вход от конзолата число.
2. Изчислете конвертирането на щатските долари към българските лева и закръглете резултата до
втория знак след десетичната запетая с вградената функция toFixed().
3. Принтирайте изхода на конзолата.*/