function cleverLily(input) {

    let age = Number(input[0]);
    let priceWash = Number(input[1]);
    let priceToy = Number(input[2]);

    let sum = 0;
    let countToys = 0;
    let countMoney = 0;

    for (let i = 1; i <= age; i++) {
        if (i % 2 === 0) {
            countMoney++;

        } else {
            countToys++;
        }

    }
    for (let i = 1; i <= countMoney; i++) {
        sum += 10 * i;
    }
    sum += (countToys * priceToy) - countMoney;

    if (sum >= priceWash) {
        console.log(`Yes! ${(sum - priceWash).toFixed(2)}`);
    } else {
        console.log(`No! ${(priceWash - sum).toFixed(2)}`);
    }
}

cleverLily([10, 170.00, 6]);
cleverLily([21, 1570.98, 3]);
/*Умната Лили
Лили вече е на N години. За всеки свой рожден ден тя получава подарък.
За нечетните рождени дни (1, 3,5...n) получава играчки, а за всеки четен (2, 4, 6...n) получава пари.
За втория рожден ден получава 10.00 лв, като сумата се увеличава с 10.00 лв, за всеки следващ четен рожден ден
 (2 -> 10, 4 -> 20, 6 -> 30...и т.н.).
 През годините Лили тайно е спестявала парите.
 Братът на Лили, в годините, които тя получава пари, взима по 1.00 лев от тях.
 Лили продала играчките получени през годините, всяка за P лева и добавила сумата към спестените пари.
 С парите искала да си купи пералня за X лева.
 Напишете програма, която да пресмята, колко пари е събрала и дали ѝ стигат да си купи пералня.

Вход
Програмата прочита 3 числа, въведени от потребителя, на отделни редове:
 Възрастта на Лили - цяло число в интервала [1...77]
 Цената на пералнята - число в интервала [1.00...10 000.00]
 Единична цена на играчка - цяло число в интервала [0...40]
Изход
Да се отпечата на конзолата един ред:
 Ако парите на Лили са достатъчни:
o “Yes! {N}” - където N е остатъка пари след покупката
 Ако парите не са достатъчни:
o “No! {М}“ - където M е сумата, която не достига
 Числата N и M трябва да за форматирани до вторият знак след десетичната запетая.
Примерен вход и изход
вход
10
170.00
6

изход
Yes! 5.00

Коментари
Първи рожден ден получава играчка; 2ри -> 10лв; 3ти -> играчка;
4ти -> 10 + 10 = 20лв; 5ти -> играчка; 6ти -> 20 + 10 = 30лв; 7ми -> играчка;
8ми -> 30 + 10 = 40лв; 9ти -> играчка; 10ти -> 40 + 10 = 50лв.
Спестила е -> 10 + 20 + 30 + 40 + 50 = 150лв. Продала е 5 играчки по 6 лв = 30лв.
Брат ѝ взел 5 пъти по 1 лев = 5лв. Остават -> 150 + 30 – 5 = 175лв.
175 >= 170 (цената на пералнята) успяла е да я купи и са и останали 175-170 = 5 лв.

вход
21
1570.98
3

изход
No! 997.98

Коментари
Спестила е 550лв. Продала е 11 играчки по 3 лв = 33лв. Брат ѝ взимал 10 години
по 1 лев = 10лв. Останали 550 + 33 – 10 = 573лв
573 < 1570.98 – не е успяла да купи пералня. Не ѝ достигат 1570.98–573 = 997.98лв
          */