function christmasSweets(input){

    let priceBaklava = +input[0];
    let priceMuffin = +input[1];
    let quantitySholen = +input[2];
    let quantityCandy = +input[3];
    let quantityBiscuits = +input[4];

    let priceSholen = priceBaklava * 1.6;
    let priceCandy = priceMuffin * 1.8;
    let priceBiscuits =7.5;

    let totalSum = (priceSholen*quantitySholen) + (priceCandy * quantityCandy)+(priceBiscuits * quantityBiscuits);

    console.log(totalSum.toFixed(2));

}
christmasSweets([6.90,4.20,1.5,2.5,1]);
christmasSweets([5.55,3.57,4.3,3.6,7]);
/*Коледни лакомства
Инна ще покани гости за Коледа и решава да ги посрещне с различни коледни лакомства. 
Тя отива до местната сладкарница, за да купи по няколко килограма от всеки вид. 
Напишете програма, която изчислява колко пари ще са необходими на Инна, според количеството и цените в сладкарницата. 
На конзолата ще бъдат въведени цените в лева на баклавата и мъфините и количеството щолен, бонбони и бисквити в килограми. 
Цените на лакомствата се формират както следва:

Щолен – 60% по-скъп от баклавата
Бонбони – 80% по-скъпи от мъфини
Бисквити – 7.50 лв. за килограм

Вход
От конзолата се четат 5 числа:

Първи ред – цена на баклавата на килограм. Реално число в интервала [0.00…40.00]
Втори ред – цена на мъфините на килограм. Реално число в интервала [0.00…30.00]
Трети ред – килограмите щолен. Реално число в интервала [0.00…50.00]
Четвърти ред – килограмите бонбони. Реално число в интервала [0.00… 70.00]
Пети ред – килограмите бисквити. Цяло число в интервала [0 ... 100]

Изход
Да се отпечата на конзолата едно число с плаваща запетая: 
колко пари ще са нужни на Инна, за да закупи всички лакомства. 
Резултатът да се форматира до втория знак след десетичната запетая.

Примерен вход и изход
Вход		
6.90
4.20
1.5
2.5
1	

Изход
42.96	

Обяснения
Цена на щолена = 6.90 + 6.90 * 0.60 = 11.04 лв. за килограм
Сума щолен = 1.5 * 11.04 = 16.56
Цена на бонбоните = 4.20 + 4.20 * 0.80 =  7.56 лв. за килограм
Сума бонбони = 2.5 * 7.56 = 18.90 
Сума бисквити = 1 * 7.50 = 7.50 
Сметка = 16.56 + 18.90 + 7.50 = 42.96


Вход	
5.55
3.57
4.3
3.6
7	

Изход
113.82	


Вход
7.79
5.35
9.3
0
0	


Изход
115.92
                  */