function christmasMarket(input){
let neededSum = +input[0];
let fantasyBook = +input[1];
let horrorBook = +input[2];
let romanticBook = +input[3];
let sum = (fantasyBook * 14.90)+(horrorBook * 9.80)+(romanticBook * 4.30);
let totalSum = sum - sum*0.20;
let donation = 0;
let bonus = 0;
if(neededSum <= totalSum){
    bonus = Math.floor((totalSum - neededSum)* 0.10);
donation = (totalSum - neededSum - bonus)+neededSum;
console.log(`${donation.toFixed(2)} leva donated.`);
console.log(`Sellers will receive ${bonus.toFixed(0)} leva.`);
}
else{
    console.log(`${(neededSum - totalSum).toFixed(2)} money needed.`);
}

}
christmasMarket([200,15,10,5]);
/*
Задача 2. Коледен базар

Коледа наближава и Коледният базар на книгата отваря врати. 
Организаторите искат да дарят определена сума от продажба на следните жанрове книги: 
фентъзи, хорър, романтика. 
Да се напише програма, която изчислява дали организаторите са успели са съберат желаната сума от продажба на книги, 
като се има предвид, че с 20 процента от изкараната сума, се заплаща ДДС.  
Книгите от всеки жанр имат различна цена:

Фентъзи – 14.90 лв.
Хорър – 9.80 лв.
Романтика – 4.30 лв.

Ако след заплащане на ДДС, целта е достигната, продавачите ще получат 10% възнаграждение от парите надвишаващи целта. 
Сумата за възнаграждение трябва да е закръглена към най-близкото цяло число надолу.
 Останалите пари, се добавят към основната сума за даряване.
Вход
От конзолата се четат 4 реда:
Парите, които организаторите искат да съберат – реално число в интервала [1.00 … 10000.00]
Брой фентъзи книги – цяло число в интервала [0 … 1000]
Брой хорър книги – цяло число в интервала [0 … 1000]
Брой романтични книги – цяло число в интервала [0 … 1000]
Изход
Отпечатването на конзолата зависи от резултата:
Ако е събрана сумата от Коледният базар :
" {дарена сума} leva donated."
"Sellers will receive {възнаграждение} leva."
Ако НЕ е достигната сумата:
"{парите нужни до достигане на целта} money needed."
Дарената/Недостигаща сума трябва да се форматира до втория знак след десетичната запетая.
Примерен вход и изход

Вход		
200
15
10
5	

Изход
267.40 leva donated.
Sellers will receive 7 leva.	

Обяснения
Сумата от продажбата => 15 * 14.90 + 10 * 9.80 + 5 * 4.30 = 343лв
20% ДДС от 343 = 68.60 лв.
Сума след заплащане на ДДС -> 274.40 лв. 
Понеже 274.40 > 200, служителите получават 10% от сумата над целта 274.40 – 200 = 74.40 лв.
10% от 74.10 = 7 лв. за продавачите.
74.40 – 7 = 67.40 лв. които добавяме към сумата за даряване. 200 + 67.40 = 267.40лв. - крайната сума, която ще бъде дарена.

Вход		 
168
5
3
8	


Изход
57.36 money needed.	


Обяснения
Сумата от продажбата => 5 * 14.90 + 3 * 9.80 + 8 * 4.30 = 138.30 лв.
20% ДДС от 138.30 = 27.68 лв.
Сума след заплащане на ДДС -> 110.64 лв. -> 110.64 < 168, не са събрани достатъчно пари, не достигат 168 – 110.64 = 57.36 лв.
*/